Reading and Writing Data using Pandas

In [1]:
import pandas as pd

In [2]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [23, 30, 25],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df=pd.DataFrame(data)

df

      Name  Age         City
0    Alice   23     New York
1      Bob   30  Los Angeles
2  Charlie   25      Chicago

In [4]:
df.to_csv("data.csv",index=False)

In [6]:
newDf=pd.read_csv("data.csv")

newDf

      Name  Age         City
0    Alice   23     New York
1      Bob   30  Los Angeles
2  Charlie   25      Chicago

In [7]:
df.to_excel("data.xlsx",index=False)